[
    {
      "ID": 1,
      "Annotation": [
        {
          "T1": "Mark kept in contact with me about the investigation but after a week they decide to send another bed frame via UPS."
        },
        {
          "T2": "Mark kept in contact with me about the investigation but after a week they decide to send another bed frame via UPS."
        },
        {
          "T2": "Even after the deliver glitch, I gave the bed five stars because the customer service was great."
        }
      ]
    },
    {
      "ID": 2,
      "Annotation": []
    },
    {
      "ID": 3,
      "Annotation": []
    },
    {
      "ID": 4,
      "Annotation": [
        {
          "T1": "I've been sleeping on them for a few weeks now and they are definitely the softest sheets I've ever slept with."
        }
      ]
    },
    {
      "ID": 5,
      "Annotation": [
        {
          "T3": "I have been using this sheet for a month."
        }
      ]
    },
    {
      "ID": 6,
      "Annotation": [
        {
          "T2": "I am curious about how well they will last and whether they will pill with multiple washings."
        },
        {
          "T4": "So far, a great buy for the money."
        }
      ]
    },
    {
      "ID": 7,
      "Annotation": []
    },
    {
      "ID": 8,
      "Annotation": [
        {
          "T1": "I bought these because of the sheer number of high reviews and am so surprised at how much I dislike them."
        }
      ]
    },
    {
      "ID": 9,
      "Annotation": [
        {
          "T1": "When I opened the package, I felt them and couldn't wait to put them on my bed."
        },
        {
          "T2": "Shortly after as I later put them on my bed, I discovered a HUGE tear in the corner of the fitted sheet."
        }
      ]
    },
    {
      "ID": 10,
      "Annotation": [
        {
          "T2": "I sorted by most expensive sheets because I wanted quality sheets on my bed and so these sheets came up."
        }
      ]
    },
    {
      "ID": 11,
      "Annotation": [
        {
          "T2": "I've paid three times this price and ended up with bottom sheets that didn't fit well, and top sheets that weren't wide enough to tuck."
        },
        {
          "T6": "I will buy them again!"
        }
      ]
    },
    {
      "ID": 12,
      "Annotation": [
        {
          "T1": "My wife made a comment about our sheets not being very comfortable and the new mattress sleeping hot."
        }
      ]
    },
    {
      "ID": 13,
      "Annotation": [
        {
          "T1": "The white sheets just arrived yesterday."
        },
        {
          "T1": "I washed them and used them last night."
        }
      ]
    },
    {
      "ID": 14,
      "Annotation": []
    },
    {
      "ID": 15,
      "Annotation": [
        {
          "T7": "I have paid more in the past for sets that turned out to be no better (and often poorer) in regard to construction."
        }
      ]
    },
    {
      "ID": 16,
      "Annotation": [
        {
          "T1": "Purchased these for our guest bedroom, which has only seen 1 family member in the past 2 years."
        },
        {
          "T2": "Turns out these sheets are so soft and comfortable that we ordered another set for a King size bed in the master suite."
        }
      ]
    },
    {
      "ID": 17,
      "Annotation": [
        {
          "T2": "This is the 3rd set of these sheets I ordered."
        }
      ]
    },
    {
      "ID": 18,
      "Annotation": [
        {
          "T2": "Had an initial issue with the sheets shedding but the seller immediately contacted me and remedied the situation."
        },
        {
          "T3": "I would wash them a couple of times to avoid the initial issue I had - cold water only, gentle cycle, and air dry thereafter (do not put in the dryer, the heat is bad)."
        }
      ]
    },
    {
      "ID": 19,
      "Annotation": [
        {
          "T1": "I've had these sheets for about 10 months, and a few months ago, they developed a smell."
        },
        {
          "T2": "I even put dryer sheets in the cabinet that I keep the sheets, just in case that was a cause, but that didn't help."
        }
      ]
    },
    {
      "ID": 20,
      "Annotation": [
        {
          "T1": "So far, I like these sheets since I find them very soft."
        },
        {
          "T2": "I would like to update this after the first wash later this week but in having these for 2 nights so far...."
        }
      ]
    },
    {
      "ID": 21,
      "Annotation": [
        {
          "T1": "I always wash new items before using."
        },
        {
          "T2": "There was a lot of lint in the dryer screen the first two washings."
        }
      ]
    },
    {
      "ID": 22,
      "Annotation": [
        {
          "T1": "My daughter pays over $250.00 for premium bamboo sheets."
        },
        {
          "T7": "I visited my sister this past November and she had these sheets and they felt equivalent to my daughter's sheets!"
        }
      ]
    },
    {
      "ID": 23,
      "Annotation": [
        {
          "T2": "Imagine my surprise when I washed them,the flat sheet and pillowcases had strings hanging from them."
        }
      ]
    },
    {
      "ID": 24,
      "Annotation": []
    },
    {
      "ID": 25,
      "Annotation": [
        {
          "T1": "So far I've purchased both white and sea foam green."
        },
        {
          "T3": "After several washes they lose some of their shine, but increase in softness!!"
        }
      ]
    },
    {
      "ID": 26,
      "Annotation": [
        {
          "T7": "I have purchased sheets in the past that's a deep pocket that never fit my mattress; It's a double pillow top queen."
        },
        {
          "T6": "I would definitely buy them again."
        }
      ]
    },
    {
      "ID": 27,
      "Annotation": [
        {
          "T1": "We got the sheets for a guest room bed so it's not like they would be used on a daily basis but, these are very, very thin."
        },
        {
          "T3": "I just hope they last a long time since they're so thin."
        }
      ]
    },
    {
      "ID": 28,
      "Annotation": []
    },
    {
      "ID": 29,
      "Annotation": [
        {
          "T1": "Pregnant and exhausted - I skipped washing these sheets and was putting them on the bed when I noticed these brown green stains in multiple spots on the sheets."
        },
        {
          "T7": "Lesson learned to always wash before handling and to not order from this company again."
        }
      ]
    },
    {
      "ID": 30,
      "Annotation": [
        {
          "T1": "I had previously used cotton but I live in Florida and they seemed so heavy."
        },
        {
          "T6": "I will never go back to cotton after using these wrinkle free sheets."
        }
      ]
    },
    {
      "ID": 31,
      "Annotation": [
        {
          "T7": "For the last ten years I was forced to spend money on overpriced uncomfortable sheets."
        },
        {
          "T6": "I'm buying a spare right now!"
        }
      ]
    },
    {
      "ID": 32,
      "Annotation": [
        {
          "T1": "I just ordered my fourth set of this sheet."
        },
        {
          "T2": "I had a weekend guest who was so happy with them she ordered a set while visiting."
        }
      ]
    },
    {
      "ID": 33,
      "Annotation": []
    },
    {
      "ID": 34,
      "Annotation": [
        {
          "T6": "I've already bought a second set for my guest bedroom and will probably be ordering another back-up set."
        }
      ]
    },
    {
      "ID": 35,
      "Annotation": [
        {
          "T1": "I actually found these sheets when we were recently staying at a VRBO property."
        },
        {
          "T2": "The first nights rest there was awesome and the sheets were so soft, I decided to investigate to buy some for myself."
        }
      ]
    },
    {
      "ID": 36,
      "Annotation": [
        {
          "T2": "I don't like that they come with instructions to ONLY WASH IN COLD WATER!"
        },
        {
          "T3": "Sheets especially white ones I always wash in warm water so they have shrunk significantly."
        }
      ]
    },
    {
      "ID": 37,
      "Annotation": [
        {
          "T6": "I like them so much that I've ordered 2 more sets."
        }
      ]
    },
    {
      "ID": 38,
      "Annotation": [
        {
          "T3": "The more you wash them, the softer they get."
        }
      ]
    },
    {
      "ID": 39,
      "Annotation": []
    },
    {
      "ID": 40,
      "Annotation": [
        {
          "T1": "My first purchase was a set of the Coral Queen sheets."
        },
        {
          "T2": "I liked them so much I decided to order a blue set."
        },
        {
          "T1": "I'm currently washing them and praying that comes out."
        }
      ]
    },
    {
      "ID": 41,
      "Annotation": [
        {
          "T1": "These sheets are great so far!"
        },
        {
          "T3": "No rips in over a week."
        }
      ]
    },
    {
      "ID": 42,
      "Annotation": [
        {
          "T1": "Received these sheets today and they came in damaged."
        }
      ]
    },
    {
      "ID": 43,
      "Annotation": [
        {
          "T1": "These felt very soft and as I unfolded them I was hopeful, but even before I finished taking it out of the package I discovered that the edging thread on the flat sheet was unraveling in the package!"
        }
      ]
    },
    {
      "ID": 44,
      "Annotation": [
        {
          "T2": "These are super soft and fit well, but unfortunately after a few washes, they do not wash well and get little cotton balls on them."
        },
        {
          "T6": "I won't buy again."
        }
      ]
    },
    {
      "ID": 45,
      "Annotation": [
        {
          "T1": "I washed them one time, today, when I received them."
        }
      ]
    },
    {
      "ID": 46,
      "Annotation": []
    },
    {
      "ID": 47,
      "Annotation": [
        {
          "T1": "This is the 3rd set of these sheets I ordered."
        }
      ]
    },
    {
      "ID": 48,
      "Annotation": [
        {
          "T1": "We ordered these sheets after reading so many positive reviews."
        }
      ]
    },
    {
      "ID": 49,
      "Annotation": []
    },
    {
      "ID": 50,
      "Annotation": [
        {
          "T1": "I did not get hot/sweat overnight and we're in triple digit temperatures."
        },
        {
          "T6": "Will be getting another set"
        }
      ]
    },
    {
      "ID": 51,
      "Annotation": [
        {
          "T1": "I've had these sheets for a week and the fabric has created these little tiny white balls of fabric that shred everywhere."
        },
        {
          "T6": "Throwing away these sheets ASAP!"
        }
      ]
    },
    {
      "ID": 52,
      "Annotation": [
        {
          "T1": "We live in Montana and it gets down to 30 and 40s at night during summer time and colder in winter."
        },
        {
          "T6": "I bought two pairs and will be buying more!"
        }
      ]
    },
    {
      "ID": 53,
      "Annotation": [
        {
          "T1": "No acostumbro a hacer muchas reseñas pero este juego de sábanas las merece, es muy suave al tacto, lo compré de color blanco y es verdaderamente increíble no puedo decir de su resistencia a las manchas pk aún no las tiene."
        }
      ]
    },
    {
      "ID": 54,
      "Annotation": [
        {
          "T1": "I washed these sheets and they sat in the dryer over night."
        }
      ]
    },
    {
      "ID": 55,
      "Annotation": [
        {
          "T3": "I've washed them MANY times and they are holding up well."
        },
        {
          "T6": "I will purchase again!"
        }
      ]
    },
    {
      "ID": 56,
      "Annotation": [
        {
          "T3": "I've washed them MANY times and they are holding up well."
        },
        {
          "T6": "I will purchase again!"
        }
      ]
    },
    {
      "ID": 57,
      "Annotation": [
        {
          "T1": "I washed right out of package and saw that the seams fell apart on fitted sheet after first wash."
        },
        {
          "T7": "Bought a few months ago and just opened brand new… Too late to return now."
        }
      ]
    },
    {
      "ID": 58,
      "Annotation": []
    },
    {
      "ID": 59,
      "Annotation": [
        {
          "T1": "then I noticed these the second night."
        },
        {
          "T3": "I've washed them three times now and still they shed after sleeping in them."
        }
      ]
    },
    {
      "ID": 60,
      "Annotation": [
        {
          "T1": "then I noticed these the second night."
        },
        {
          "T3": "I've washed them three times now and still they shed after sleeping in them."
        }
      ]
    },
    {
      "ID": 61,
      "Annotation": [
        {
          "T1": "Right out of the dryer they are easy to make the bed."
        }
      ]
    },
    {
      "ID": 62,
      "Annotation": [
        {
          "T7": "After years of sheets that pilled & felt rough, I'm so relieved to find these!"
        }
      ]
    },
    {
      "ID": 63,
      "Annotation": [
        {
          "T1": "I have purchased them 8 days, and I am still extremely satisified withy them."
        },
        {
          "T3": "Most stains wash out pretty easily with bleach."
        }
      ]
    },
    {
      "ID": 64,
      "Annotation": []
    },
    {
      "ID": 65,
      "Annotation": [
        {
          "T1": "Came with standard size 2 pillows cases, flat sheet, and fitted sheet."
        }
      ]
    },
    {
      "ID": 66,
      "Annotation": [
        {
          "T1": "I washed them before I noticed how bad they were."
        }
      ]
    },
    {
      "ID": 67,
      "Annotation": [
        {
          "T1": "Washed and dried the sheets."
        },
        {
          "T3": "Amount of lint in the dryer filter was ridiculous."
        },
        {
          "T7": "I wonder how long these will last given how much fabric came out in the dryer."
        }
      ]
    },
    {
      "ID": 68,
      "Annotation": []
    },
    {
      "ID": 69,
      "Annotation": [
        {
          "T1": "Took them right out of the package and put them on the bed."
        },
        {
          "T2": "So soft, can't wait to sleep on them tonight!!"
        }
      ]
    },
    {
      "ID": 70,
      "Annotation": [
        {
          "T1": "They are very comfortable."
        },
        {
          "T6": "Hopefully it will keep my husband from complaining about being hot at night."
        }
      ]
    },
    {
      "ID": 71,
      "Annotation": [
        {
          "T1": "I just purchased these and it seems like a good set so far."
        }
      ]
    },
    {
      "ID": 72,
      "Annotation": [
        {
          "T1": "Got these sheets for my queen bed and they are actually nice."
        }
      ]
    },
    {
      "ID": 73,
      "Annotation": []
    },
    {
      "ID": 74,
      "Annotation": [
        {
          "T1": "I washed and dried the bed sheets with the blanket only, in a cold cycle and they did not wrinkle."
        },
        {
          "T6": "I am very pleased."
        }
      ]
    },
    {
      "ID": 75,
      "Annotation": [
        {
          "T1": "Slept great on them and we're hot sleepers, but you can see through the pillow shams and it which makes it look a little cheap."
        }
      ]
    },
    {
      "ID": 76,
      "Annotation": []
    },
    {
      "ID": 77,
      "Annotation": [
        {
          "T3": "I've only washed one time and they washed up nicely and not a lot of wrinkles."
        },
        {
          "T6": "I will definitely order an second set"
        }
      ]
    },
    {
      "ID": 78,
      "Annotation": []
    },
    {
      "ID": 79,
      "Annotation": []
    },
    {
      "ID": 80,
      "Annotation": [
        {
          "T1": "After the third night I had to take them off because every night was the same issue."
        },
        {
          "T7": "I can't believe how much these sheets make me sweat."
        }
      ]
    },
    {
      "ID": 81,
      "Annotation": [
        {
          "T1": "Awful - bought these in advance and actually just got a chance to use them."
        },
        {
          "T7": "My mistake - beyond the window to return."
        }
      ]
    },
    {
      "ID": 82,
      "Annotation": [
        {
          "T3": "They've held up even after quite a few washes already."
        },
        {
          "T6": "Would definitely buy these again."
        }
      ]
    },
    {
      "ID": 83,
      "Annotation": []
    },
    {
      "ID": 84,
      "Annotation": [
        {
          "T2": "Take out of dryer as soon as they are dry and place on your bed."
        }
      ]
    },
    {
      "ID": 85,
      "Annotation": []
    },
    {
      "ID": 86,
      "Annotation": []
    },
    {
      "ID": 87,
      "Annotation": [
        {
          "T1": "I’m loving these sheets."
        }
      ]
    },
    {
      "ID": 88,
      "Annotation": []
    },
    {
      "ID": 89,
      "Annotation": [
        {
          "T1": "I had a major surgery and wanted some comfy sheets for my recover and these were amazing and didn't stain!"
        },
        {
          "T6": "Ordered more just to alternate between washes."
        }
      ]
    },
    {
      "ID": 90,
      "Annotation": [
        {
          "T1": "These sheets are soooo soft, not quite wrinkle free but I'm looking for comfort more than looks."
        },
        {
          "T6": "I hope they do well over time, if they do I'm buying so many more colors."
        }
      ]
    },
    {
      "ID": 91,
      "Annotation": [
        {
          "T1": "Washed these for use after I have my baby at home, so haven't slept on them yet, but after washing they are so soft."
        },
        {
          "T7": "I suspect they will be full of holes not long after."
        }
      ]
    },
    {
      "ID": 92,
      "Annotation": [
        {
          "T1": "I needed new sheets as I'm getting an apartment soon."
        },
        {
          "T7": "I compare it to hotel sheets as it feels like the cold sheets."
        }
      ]
    },
    {
      "ID": 93,
      "Annotation": [
        {
          "T6": "will be purchasing the fall colors shortly"
        }
      ]
    },
    {
      "ID": 94,
      "Annotation": [
        {
          "T6": "I immediately ordered a different set."
        }
      ]
    },
    {
      "ID": 95,
      "Annotation": [
        {
          "T1": "Washed very well without wrinkling and is soft to the touch."
        }
      ]
    },
    {
      "ID": 96,
      "Annotation": [
        {
          "T6": "I will buy these again and again and give as gifts."
        }
      ]
    },
    {
      "ID": 97,
      "Annotation": [
        {
          "T6": "I will buy more."
        }
      ]
    },
    {
      "ID": 98,
      "Annotation": []
    },
    {
      "ID": 99,
      "Annotation": [
        {
          "T1": "First time buying these!"
        },
        {
          "T2": "Wanted to wait until I washed them to leave a review."
        }
      ]
    },
    {
      "ID": 100,
      "Annotation": [
        {
          "T1": "I haven't had it long enough to rate the stain resistant but for the cost, the quality seems to be amazing!"
        }
      ]
    }
  ]
  